# InUse Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireSize..::..InUse Property
WireSize Class See Also
---
Get or set whether the size can be used in sizing.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool InUse { get; set; }
```

Visual Basic
---
```text
Public Property InUse As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool InUse {
	bool get ();
	void set (bool value);
}
```

# See Also
WireSize Class
Autodesk.Revit.DB.Electrical Namespace